# HasSchedulableField Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..HasSchedulableField Property
ScheduleField Class See Also
---
Identifies if this ScheduleField object has access to a SchedulableField. Calculated and combined parameter fields will not have the access.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool HasSchedulableField { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasSchedulableField As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasSchedulableField {
	bool get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace